In [1]:
import pandas as pd 
import numpy as np
from pandas import Series,DataFrame
from numpy.random import randn

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:

chicago = pd.read_csv("chicago.csv")

chicago["Department"] = chicago["Department"].astype("category")

chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [ ]:

chicago.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
Name                      32062 non-null object
Position Title            32062 non-null object
Department                32062 non-null category
Employee Annual Salary    32062 non-null object
dtypes: category(1), object(3)
memory usage: 783.1+ KB

In [ ]:

chicago["Department"].nunique()

35

In [ ]:

chicago["Department"].count()

32062

## Common String Methods-  `.lower()` , `.upper()` , `.title()` , and `.len()`

In [3]:

chicago = pd.read_csv("chicago.csv")

chicago["Department"] = chicago["Department"].astype("category")

chicago.head(3)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00
2     AARON,  KARINA    POLICE OFFICER       POLICE              $84450.00

In [6]:
# .lower() : Changing all the upper case letters to lower case.

"Hello World".lower()

'hello world'

In [8]:
# .upper() : Changing all the lower case letters to upper case.

"hello world".upper()

'HELLO WORLD'

In [10]:
# .title() : Changing first letters of the each world to upper case.

"hello world".title()

'Hello World'

In [11]:

len("hello world")

11

In [14]:
# .str : indicating the dtype of the values of the column before changing upper cases to lower cases.

chicago["Name"].str.lower()

0            aaron,  elvia j
1          aaron,  jeffery m
2             aaron,  karina
3        aaron,  kimberlei r
4        abad jr,  vicente m
                ...
32058     zygowicz,  peter j
32059      zymantas,  mark e
32060    zyrkowski,  carlo e
32061    zyskowski,  dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object